rocksdb/experiments/M2/results/20260429-055153-budget-sensitivity/bmin_2_ptarget_0p5/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:57:07 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777442227388936 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       7.114 micros/op 140561 ops/sec 35.572 seconds 5000000 operations;  139.4 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      10.070 micros/op 99300 ops/sec 50.352 seconds 5000000 operations;   98.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.076 micros/op 90287 ops/sec 55.379 seconds 5000000 operations;   89.5 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     10/0   622.88 MB   2.5      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    416.2     35.92             25.30       240    0.150       0      0       0.0       0.0
  L1     23/1    1.40 GB   5.3     27.0    14.0     13.0      23.8     10.8       0.0   1.7    359.5    316.9     76.77             54.28        20    3.838     27M  3250K       0.0       0.0
  L2     98/3    4.50 GB   1.8     20.2     8.8     11.4      15.3      3.9       0.6   1.7    343.3    259.9     60.20             43.95       145    0.415     20M  4986K       0.0       0.0
 Sum    131/4    6.50 GB   0.0     47.1    22.8     24.3      53.6     29.3       0.6   3.7    279.1    317.7    172.89            123.53       405    0.427     47M  8236K       0.0       0.0
 Int      0/0    0.00 KB   0.0     46.9    22.6     24.3      53.0     28.7       0.6   3.7    280.1    316.8    171.38            122.45       398    0.431     47M  8232K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.1    22.8     24.3      39.0     14.7       0.0   0.0    352.4    291.8    136.97             98.23       165    0.830     47M  8236K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    416.2     35.92             25.30       240    0.150       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 141.3 total, 138.3 interval
Flush(GB): cumulative 14.598, interval 14.233
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.63 GB write, 388.64 MB/s write, 47.13 GB read, 341.52 MB/s read, 172.9 seconds
Interval compaction: 53.03 GB write, 392.62 MB/s write, 46.89 GB read, 347.15 MB/s read, 171.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 19, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 21, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 21, total-stops: 0
interval: 21 total count
Block cache LRUCache@0x559ea79f3df0#84439 capacity: 32.00 MB seed: 76710408 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000179 secs_since: 141
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 141.3 total, 138.3 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 106.90 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 106.90 MB/s
Cumulative stall: 00:00:38.246 H:M:S, 27.1 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14658.86 MB, 105.99 MB/s
Interval WAL: 14M writes, 0 syncs, 14555802.00 writes per sync, written: 14.32 GB, 105.99 MB/s
Interval stall: 00:00:38.246 H:M:S, 27.7 percent
Write Stall (count): write-buffer-manager-limit-stops: 0